<html>

<head>
    <meta content="text/html; charset=UTF-8" http-equiv="content-type">
    
</head>

<body class="c6 doc-content">
    <h1 class="c22" id="h.sncw438yrn7a"><span class="c18 c23">&#23653;&#27511;&#34920;</span></h1>
    <h2 class="c2" id="h.umc4361q8as7"><span class="c9">&#34081;&#24503;&#35488;Ted</span></h2>
    <p class="c0"><span
            class="c5">&#24460;&#31471;&#24037;&#31243;&#24107;&#12289;&#20840;&#31471;&#24037;&#31243;&#24107;</span>
    </p>
    <p class="c0"><span class="c5">E-mai:</span></p>
    <p class="c0"><span>:</span><span class="c21"><a class="c19"
                href="mailto:tugfuidseujzx@gmail.com">tugfuidseujzx@gmail.com</a></span></p>
    <h2 class="c2" id="h.cbbqbtxfw447"><span class="c9">&#38364;&#26044;&#25105;</span></h2>
    <p class="c0"><span
            class="c12 c24">&#29105;&#24561;&#19988;&#31309;&#26997;&#36914;&#21462;&#30340;&#24460;&#31471;&#24037;&#31243;&#24107;&#65292;&#30050;&#26989;&#26044;&#22283;&#31435;&#24432;&#21270;&#24107;&#31684;&#22823;&#23416;&#25976;&#23416;&#31995;&#36039;&#35338;&#32068;&#12290;&#25484;&#25569;
            Python&#65288;Flask/Django&#65289;&#12289;Kotlin&#12289;HTML+CSS &#12289;JavaScript&#20197;&#21450; MySQL
            &#36039;&#26009;&#24235;&#65292;&#20855;&#20633;&#31995;&#32113;&#35373;&#35336;&#33287; API
            &#38283;&#30332;&#23526;&#20316;&#32147;&#39511;&#12290;&#26366;&#22312;&#35506;&#22530;&#19978;&#29544;&#31435;&#38283;&#30332;&#28779;&#36554;&#26597;&#35426;&#31995;&#32113;&#65292;&#20855;&#20633;&#33391;&#22909;&#30340;&#21839;&#38988;&#35299;&#27770;&#33021;&#21147;&#33287;&#22296;&#38538;&#21512;&#20316;&#31934;&#31070;&#65292;&#26399;&#24453;&#21152;&#20837;&#23560;&#26989;&#22296;&#38538;&#24460;&#25345;&#32396;&#31934;&#36914;&#24460;&#31471;&#38283;&#30332;&#25216;&#33021;&#65292;&#20006;&#28858;&#20844;&#21496;&#21109;&#36896;&#20729;&#20540;&#12290;</span>
    </p>
    <h2 class="c2" id="h.t7hpuabutnap"><span class="c9">&#23560;&#38263;</span></h2>
    <ul class="c8 lst-kix_e2g5xmnf7njk-0 start">
        <li class="c11 c7 li-bullet-0"><span class="c4">Git:</span><span
                class="c15">&#25484;&#25569;git&#20351;&#29992;&#27969;&#31243;(&#26371;&#29992;git&#19978;&#20659;&#12289;&#20462;&#25913;&#20316;&#21697;&#21040;github&#65292;&#20102;&#35299;git&#26550;&#27083;&#65292;&#20102;&#32080;&#22914;&#20309;&#36879;&#36942;git
                flow&#21644;&#20154;&#21512;&#20316;)</span></li>
    </ul>
    <p class="c1 c17 c20"><span class="c16"></span></p>
    <ul class="c8 lst-kix_2mbolh96isvf-0 start">
        <li class="c7 c11 li-bullet-0"><span class="c4">Python:</span><span
                class="c15">&#25484;&#25569;&#35486;&#27861;&#26550;&#27083;&#65292;&#26377;&#36879;&#36942;python&#38283;&#30332;&#24460;&#31471;&#30340;&#32147;&#39511;</span>
        </li>
    </ul>
    <p class="c14 c17"><span class="c13"></span></p>
    <ul class="c8 lst-kix_ujclo1m5i00s-0 start">
        <li class="c11 c7 li-bullet-0"><span class="c4">MySQL:</span><span
                class="c15">&#25484;&#25569;MySQL&#22522;&#26412;&#25805;&#20316;(&#21253;&#25324;:&#21109;&#24314;&#36039;&#26009;&#24235;&#12289;&#32173;&#35703;&#12289;&#31649;&#29702;&#12289;&#24555;&#36895;&#26597;&#35426;&#31561;&#21151;&#33021;)</span>
        </li>
    </ul>
    <ul class="c8 lst-kix_pzu9c0hr3jbp-0 start">
        <li class="c11 c7 li-bullet-0"><span class="c25">Kotlin:</span><span
                class="c15">&#25484;&#25569;Kotlin&#22522;&#26412;&#35486;&#27861;&#26550;&#27083;&#12290;</span></li>
    </ul>
    <ul class="c8 lst-kix_fuagnw30ry81-0 start">
        <li class="c7 c14 li-bullet-0"><span class="c4">Java:</span><span
                class="c15">&#22522;&#26412;&#35486;&#27861;&#21644;&#29289;&#20214;&#26371;&#20351;&#29992;&#12290;</span>
        </li>
    </ul>
    <h2 class="c2" id="h.3lnoptp3ijla"><span class="c9">&#24037;&#20316;&#32147;&#27511;</span></h2>
    <ul class="c8 lst-kix_9hehc6nc5ho5-0 start">
        <li class="c0 c7 li-bullet-0"><span class="c5">&#23478;&#26063;&#20225;&#26989;</span></li>
    </ul>
    <h2 class="c2" id="h.nj9pjzbdq7e0"><span class="c9">&#33258;&#20659;</span></h2>
    <p class="c1"><span
            class="c10">&#25105;&#26159;&#34081;&#24503;&#35488;&#65292;&#30050;&#26989;&#26044;&#22283;&#31435;&#24432;&#21270;&#24107;&#31684;&#22823;&#23416;&#25976;&#23416;&#31995;&#36039;&#35338;&#32068;&#12290;&#22235;&#24180;&#30340;&#22823;&#23416;&#23416;&#32722;&#19981;&#20677;&#22521;&#39178;&#20102;&#25105;&#25166;&#23526;&#30340;&#37007;&#36655;&#24605;&#32173;&#33287;&#25976;&#23416;&#22522;&#30990;&#65292;&#20063;&#35731;&#25105;&#23565;&#31243;&#24335;&#38283;&#30332;&#29986;&#29983;&#20102;&#28611;&#21402;&#30340;&#33288;&#36259;&#12290;&#22312;&#23416;&#26399;&#38291;&#65292;&#25105;&#25509;&#35320;&#21040;
            Python&#12289;Kotlin &#33287; MySQL
            &#31561;&#25216;&#34899;&#65292;&#20006;&#23436;&#25104;&#20102;&#25976;&#20491;&#20855;&#26377;&#25361;&#25136;&#24615;&#30340;&#23560;&#26696;&#65292;&#36880;&#27493;&#22880;&#23450;&#20102;&#25105;&#23565;&#24460;&#31471;&#38283;&#30332;&#30340;&#29105;&#24773;&#33287;&#23560;&#26989;&#22522;&#30990;&#12290;</span>
    </p>
    <p class="c1"><span
            class="c10">&#22312;&#23416;&#26399;&#38291;&#65292;&#25105;&#26366;&#23436;&#25104;&#28779;&#36554;&#26597;&#35426;&#31995;&#32113;&#30340;&#23560;&#26696;&#65292;&#36000;&#36012;&#24460;&#31471;&#26550;&#27083;&#35373;&#35336;&#12289;&#36039;&#26009;&#24235;&#24314;&#27169;&#33287;
            API &#38283;&#30332;&#12290;&#35442;&#23560;&#26696;&#20351;&#29992; Python
            &#32232;&#23531;&#21830;&#26989;&#37007;&#36655;&#65292;&#20006;&#25505;&#29992; MySQL
            &#20786;&#23384;&#20006;&#31649;&#29702;&#28779;&#36554;&#25976;&#25818;&#65292;&#25104;&#21151;&#23526;&#29694;&#21363;&#26178;&#30340;&#26178;&#21051;&#34920;&#33287;&#31080;&#20729;&#26597;&#35426;&#21151;&#33021;&#12290;&#22312;&#36889;&#20491;&#36942;&#31243;&#20013;&#65292;&#25105;&#23416;&#26371;&#22914;&#20309;&#24478;&#38656;&#27714;&#20998;&#26512;&#21040;&#31995;&#32113;&#35373;&#35336;&#36914;&#34892;&#23436;&#25972;&#30340;&#23526;&#20316;&#65292;&#20063;&#36880;&#28472;&#29087;&#24713;&#22914;&#20309;&#23559;&#21069;&#24460;&#31471;&#25972;&#21512;&#65292;&#25552;&#21319;&#20351;&#29992;&#32773;&#39636;&#39511;&#12290;</span>
    </p>
    <p class="c1"><span
            class="c10">&#38500;&#20102;&#23560;&#26696;&#32147;&#39511;&#65292;&#25105;&#23565;&#23416;&#32722;&#26032;&#25216;&#34899;&#20805;&#28415;&#29105;&#24773;&#12290;&#24478;&#25509;&#35320;&#31243;&#24335;&#35373;&#35336;&#38283;&#22987;&#65292;&#25105;&#32147;&#24120;&#21443;&#33287;&#32218;&#19978;&#35506;&#31243;&#33287;&#25216;&#34899;&#31038;&#32676;&#65292;&#20027;&#21205;&#25506;&#32034;&#22914;&#20309;&#36939;&#29992;&#31243;&#24335;&#35299;&#27770;&#23526;&#38555;&#21839;&#38988;&#12290;&#20363;&#22914;&#65292;&#20351;&#29992;
            Python &#36899;&#25509;&#21488;&#37941; API
            &#29554;&#21462;&#36039;&#26009;&#65292;&#20006;&#23559;&#25972;&#29702;&#24460;&#30340;&#36039;&#26009;&#21295;&#20837;&#36039;&#26009;&#24235;&#12290;&#20381;&#25818;&#35373;&#35336;&#30340;&#19977;&#38917;&#28779;&#36554;&#26597;&#35426;&#21151;&#33021;&#65292;&#20998;&#21029;&#38283;&#30332;&#19977;&#20491;&#20282;&#26381;&#22120;&#65288;Server&#65289;&#65292;&#26368;&#24460;&#20197;
            Kotlin
            &#38283;&#30332;&#31777;&#26131;&#30340;&#25163;&#27231;&#25033;&#29992;&#31243;&#24335;&#20006;&#20018;&#25509;
            API&#12290;&#25105;&#30456;&#20449;&#25345;&#32396;&#23416;&#32722;&#26159;&#25216;&#34899;&#20154;&#30340;&#26680;&#24515;&#31478;&#29229;&#21147;&#65292;&#32780;&#36889;&#20063;&#27491;&#26159;&#25105;&#27138;&#26044;&#25361;&#25136;&#26410;&#30693;&#30340;&#21407;&#22240;&#12290;</span>
    </p>
    <p class="c1"><span
            class="c10">&#22312;&#24615;&#26684;&#19978;&#65292;&#25105;&#26159;&#19968;&#20491;&#36012;&#20219;&#24863;&#24375;&#12289;&#37325;&#35222;&#32048;&#31680;&#30340;&#20154;&#65292;&#23565;&#26044;&#38656;&#35201;&#37007;&#36655;&#25512;&#28436;&#33287;&#31934;&#28310;&#23526;&#20316;&#30340;&#20219;&#21209;&#20805;&#28415;&#33288;&#36259;&#12290;&#25105;&#36942;&#21435;&#26366;&#21443;&#33287;&#22810;&#27425;&#22296;&#38538;&#21512;&#20316;&#65292;&#28145;&#30693;&#28317;&#36890;&#33287;&#21332;&#20316;&#30340;&#37325;&#35201;&#24615;&#65292;&#20063;&#33021;&#24555;&#36895;&#36969;&#25033;&#20006;&#34701;&#20837;&#26032;&#30340;&#24037;&#20316;&#29872;&#22659;&#12290;&#25105;&#30456;&#20449;&#36889;&#20123;&#29305;&#36074;&#65292;&#23559;&#20351;&#25105;&#25104;&#28858;&#19968;&#21517;&#20540;&#24471;&#20449;&#36084;&#30340;&#24460;&#31471;&#38283;&#30332;&#24037;&#31243;&#24107;&#12290;</span>
    </p>
    <p class="c1"><span class="c12 c26">&#23637;&#26395;&#26410;&#20358;&#65292;</span><span
            class="c12">&#25105;&#24076;&#26395;&#33021;&#22312;&#19968;&#20491;&#20197;&#25216;&#34899;&#28858;&#26680;&#24515;&#30340;&#22296;&#38538;&#20013;&#30332;&#25582;&#23560;&#38263;&#65292;</span><span
            class="c10">&#31309;&#26997;&#21443;&#33287;&#24460;&#31471;&#26550;&#27083;&#35373;&#35336;&#12289;&#36039;&#26009;&#24235;&#20778;&#21270;&#33287;
            API
            &#38283;&#30332;&#65292;&#20006;&#25345;&#32396;&#23416;&#32722;&#38642;&#31471;&#25216;&#34899;&#33287;&#24494;&#26381;&#21209;&#26550;&#27083;&#12290;&#25105;&#26399;&#24453;&#34249;&#30001;&#23526;&#38555;&#21443;&#33287;&#38283;&#30332;&#23560;&#26696;&#65292;&#19981;&#26039;&#25552;&#21319;&#33258;&#24049;&#30340;&#25216;&#34899;&#33021;&#21147;&#65292;&#28858;&#20844;&#21496;&#21109;&#36896;&#20729;&#20540;&#30340;&#21516;&#26178;&#65292;&#36880;&#27493;&#23526;&#29694;&#25104;&#28858;&#36039;&#28145;&#24037;&#31243;&#24107;&#30340;&#32887;&#28079;&#30446;&#27161;</span>
    </p>
    <p class="c0 c17"><span class="c5"></span></p>
    <p class="c0 c17"><span class="c5"></span></p>
</body>

</html>